#include <stdio.h>                                  // นำเข้าไลบรารีมาตรฐาน สำหรับการรับค่าและแสดงผล (printf)

int main() {                                        // ฟังก์ชันหลักของโปรแกรม จุดเริ่มต้นเมื่อรัน

    int sum, p, x, y;                               // ประกาศตัวแปรชนิด int 4 ตัว คือ sum, p, x, y
    sum = 0;                                        // กำหนดค่าเริ่มต้นของ sum เป็น 0 เพื่อใช้เก็บผลรวม

    for (x = 1, y = 1; x * y <= 15; x++, y += 2) {  // ลูป for เริ่มต้น x=1, y=1  
                                                    // เงื่อนไขทำงานต่อเมื่อ x*y <= 15  
                                                    // หลังจากจบรอบแต่ละรอบ x เพิ่มขึ้นทีละ 1, y เพิ่มขึ้นทีละ 2

    
        p = x * y;                                  // คำนวณผลคูณของ x และ y แล้วเก็บไว้ในตัวแปร p
        sum = sum + p;                              // บวกผลคูณ p เข้ากับ sum เพื่อเก็บผลรวมสะสม
        printf("%d * %d = %d\n", x, y, p);          // แสดงผลลัพธ์การคูณแต่ละรอบ เช่น "1 * 1 = 1"

    }

    printf("summation of x * y = %d\n", sum);       // แสดงผลรวมของ x*y หลังจบลูป
   
    return 0;                                       // คืนค่า 0 เพื่อบอกว่าโปรแกรมทำงานสำเร็จสมบูรณ์
}
